#include <unistd.h>
#include <stdlib.h>
#include <stdio.h>
#include <string.h>
#include <time.h>
#include <stdio.h>

int  main()
{
	int iOutPro=0;//拜访局省份号
	int iInPro=0;//归属地省份号
	int iCallNum = 100000;        //遍历开始序号
	int iCountFile ;    //一个文件记录条数
	int iEnd = 0;  //遍历结束序号
	int iList1 =   100000;  //本节点序列号
	int iFileNO=0;          //文件序中列号
	int iCount=150;                 //每个省生成文件数量
	int iSend =49800;          //每个文件结尾记录的条数\每个文件条数

	char chTime[16];
	char chHour[16];
	char chBill[1024];   //话单记录内容
	char chStart[1024];  //文件头
	char chEnd[1024];    //文件尾
	char chFilename[64];
	char chFilenametmp[64];
	memset(chTime,0, sizeof(chTime));
	memset(chHour,0, sizeof(chHour));
	memset(chBill,0, sizeof(chBill));
	memset(chStart,0, sizeof(chStart));
	memset(chEnd,0, sizeof(chEnd));
	memset(chFilename,0, sizeof(chFilename));
	memset(chFilenametmp,0, sizeof(chFilenametmp));

	FILE *fp;

	//单个文件31个省遍历
	int iList[32]={10,22,21,23,311,791,531,351,471,371,24,27,431,731,451,20,25,771,898,28,571,851,551,871,591,29,891,931,971,951,991};
	int iIMIS[128]={759589,991776,126753,240496,462594,964469,262578,538588,598806,135229,973919,359798,479594,928243,846407,875694,532253,902076,744424,299211,668934,218231,804021,593576,247602,877069,571361,994766,581542,583334,901025,875685,345731,187797,556496,237694,194643,672446,503743,163448,229096,617949,426622,485928,782921,538221,641153,254846,512541,909848,144274,528712,229183,155674,836668,825386,534644,751441,869515,639784,459407,478509,575955,608548,479324,578225,331394,901821,509927,852623,195951,653245,351918,557629,136031,785395,464231,325162,456427,100176,823362,345205,253374,544649,346769,184015,918667,958664,239619,222948,232238,992629,580553,587328,883124,510069,475162,827138,437507,970706};
	int iSgw[40]={1586,5118,9995,8795,8159,2128,7935,8220,8351,9167,7057,7596,4087,9737,7739,8995,1086,2993,2801,9169,1794,7974,4577,3945,5294,7728,2709,7626,6019,5160,5689,5158,38352,88631,49020,91764,38188,33500,49315,69210};
	int iRat[6]={33,59,99,80};
	
	int iList111[32]={10,10,20,20,21,21,22,22,23,23,24,24,25,25,27,27,27,28,28,28,29,29,29,311,311,351,351,371,371,371,451,451,471,471,471,531,531,531,531,551,551,571,571,571,591,591,591,731,731,771,771,791,791,791,851,851,871,871,891,891,898,898,931,931,931,951,951,971,971,991,991,};
	char chIMIS111[80][22]={"460110137120718","460110714234221","460110031485677","460110032875914","460031207119873","460038420108202","460030995412157","460037981471784","460110310330999","460110740337622","460110797761375","460110110074292","460110156971421","460110140186216","460030258165588","460030993401932","460110723772240","460110759131416","460110550248202","460110550738041","460110530533813","460110530056450","460110583474276","460110752936897","460110582358536","460110195005574","460110191206542","460110195677641","460031209244852","460030406776062","460031544404299","460031204047700","460030417126007","460031026273342","460110480900711","460110481809666","460110260847395","460110805597661","460110260846148","460110382610279","460110783345545","460110603299887","460110601943201","460110706322854","460110620052694","460110620464490","460110013831570","460110016505252","460110903996310","460110903771407","460110334474057","460110674593373","460110890516898","460110074726321","460110074726323","460110074726323","460110230369902","460110231561608","460110091515241","460110083023259","460110643913275","460110644064745","460110521746472","460110822810074","460110500365177","460037951848508","460030968307776","460110570509095","460110708590526","460110403884278","460110400966921"};
	
	
	char chChargid[8][22]={"FE010A0B","FE010A0B","FE010A0B","FE010A0B","FE010A0B","FE010A0B"};
	char chList[20][50]={
		"FFFF0001",
		"fe80:0:0:0:204:61ff:fe9d:f156",
		"fe80::201:61ff:fe9d:f156",
		"fe80:0:0:0:0204:61ff:254.157.241.86",
		"fe80::",
		"2001:0db8:85a3:08d3:1319:8a2e:0370:7341",
		"2001:0db8:85a3:08d3:1319:8a2e:0370:7342",
		"fe80::202:61ff:fe9d:f156",
		"2001:0db8:85a3:08d3:1319:8a2e:0370:7343",
		"2001:0db8:85a3:08d3:1319:8a2e:0370:7344",
		"2001:0db8:85a3:08d3:1319:8a2e:0370:7321",
		"2001:0db8:85a3:08d3:1319:8a2e:0370:7322",
		"fe80::203:61ff:fe9d:f156",
		"2001:0db8:85a3:08d3:1319:8a2e:0370:7323",
		"2001:0db8:85a3:08d3:1319:8a2e:0370:7324",
		"2001:0db8:85a3:08d3:1319:8a2e:0370:7331",
		"2001:0db8:85a3:08d3:1319:8a2e:0370:7332",
		"fe80::204:61ff:fe9d:f156",
		"2001:0db8:85a3:08d3:1319:8a2e:0370:2331",
		"2001:0db8:85a3:08d3:1319:8a2e:0370:3331"};
		
	time_t tt = time(NULL);//造话单时间精确到分，防止重复
	tm* t= localtime(&tt);
	sprintf(chTime,"%d%02d%02d%02d%02d",t->tm_year + 1900,
	t->tm_mon + 1,
	t->tm_mday,
	t->tm_hour,
	t->tm_min);
	sprintf(chHour,"%d%02d%02d%02d",t->tm_year + 1900,
	t->tm_mon + 1,
	t->tm_mday,
	t->tm_hour);


	int i = 0;
	while(i<31)
	{
	  iCountFile =  iSend;    //一个文件记录条数
		iOutPro = iList[i];
		printf("file%d:\n",i,iOutPro);
		while(iFileNO < iCount)//一个省生成多个文件
		{
			iFileNO++;
			iEnd = iCallNum + iSend;

			////LNIG_2018071018025.0006.00
			sprintf(chFilenametmp,"/data/sr/roam_in/~LNIG_%s%03d.%04d.00",chHour,
			iOutPro,
			iFileNO);
			printf("filename:%s\n",chFilenametmp);

			sprintf(chFilename,"/data/sr/roam_in/LNIG_%s%03d.%04d.00",chHour,
			iOutPro,
			iFileNO);
			printf("filename:%s\n",chFilename);

			//10^46011025^46011000^0006^20180710180000^10
			sprintf(chStart,"10^46011%03d^46011000^%04d^%s0000^10\n",iOutPro,
			iFileNO,
			chHour);
			
			if(!(fp=fopen(chFilenametmp,"w")))
  	  {
  	      printf("Can not open %s\n",chFilename);
  	  }
  	  else
  	  {
				fputs(chStart,fp);//写入数据
				while(iCallNum<iEnd)
				{
					printf("%d--->%d---\n",iCallNum,iEnd);
					int i =iCallNum-int(iCallNum/31)*31;
					iInPro=iList[i];
					if(iInPro == iOutPro)
					{
						iCallNum++;
						iCountFile --;
						iEnd++;
						continue;
					}
					printf("%d---%d\n",iInPro,iOutPro);
					memset(chBill,0, sizeof(chBill));
					
					/*sprintf(chBill,"1^18938%d^460010496%d^6201482934%d^255.255.0.1^CTLTE^%s^%d^100000^%s^1^0^%d^%d^A^1000^1000^20180710170110^30^20180710170140^000000000^^460111A00091^%d^^^\n",
					iCallNum,
					iCallNum,
					iList1,
					chChargid[iCallNum-int(iCallNum/6)*6],
					iIMIS[iCallNum-int(iCallNum/100)*100],
					chList[iCallNum-int(iCallNum/20)*20],
					iInPro,
					iOutPro,
					iRat[iCallNum-int(iCallNum/4)*4]);*/
					
					
					sprintf(chBill,"1^18938%d^%s^6201482934%d^255.255.0.1^CTLTE^%s^%d^100000^%s^1^0^%d^%d^A^1000^1000^20180710170110^30^20180710170140^000000000^^460111A00091^%d^^^\n",
					iCallNum,
					chIMIS111[iCallNum-int(iCallNum/71)*71],
					iList1,
					chChargid[iCallNum-int(iCallNum/6)*6],
					iIMIS[iCallNum-int(iCallNum/100)*100],
					chList[iCallNum-int(iCallNum/20)*20],
					iList111[iCallNum-int(iCallNum/71)*71],
					iOutPro,
					iRat[iCallNum-int(iCallNum/4)*4]);


					printf("inputfile---%d\n",iCallNum);
					fputs(chBill,fp);//写入数据
					iList1++;
					iCallNum++;
				}
					printf("exit---%d\n",iCallNum);
				iCallNum = 100000;
				

				//90^46011025^46011000^0006^2^20180710170010^20180710170040^2000^2000^4000
				sprintf(chEnd,"90^46011%03d^46011000^%04d^%d^20180710170110^20180710170110^%d^%d^%d\n",iOutPro,
				iFileNO,
				iSend,
				iSend*1000,
				iSend*1000,
				iSend*1000*2);
				fputs(chEnd,fp);//写入数据
				fclose(fp);
				if(!rename(chFilenametmp,chFilename))//删除成功
				{
					printf("%s rename: %s\n",chFilenametmp,chFilename);
				}
			}
		}
		iFileNO=0;
		i++;
	}
	return 0;
}

